app/controllers/cocktails_controller.rb

  def show
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cocktail = Cocktail.new(cocktail_params)
    respond_to do |format|
      if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cachaça"], ["created_at", "2018-11-04 21:24:43.110225"], ["updated_at", "2018-11-04 21:24:43.110225"]]

    def set_cocktail
      @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]