app/controllers/doses_controller.rb

  def new
    @cocktail = Cocktail.find(params[:cocktail_id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 387], ["LIMIT", 1]]

  def create
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose = Dose.new(dose_params)
    @dose.cocktail = @cocktail
    @dose.save
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "cocktail_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Muiy arruiba"], ["cocktail_id", 18], ["ingredient_id", 4], ["created_at", "2018-11-04 22:23:03.398369"], ["updated_at", "2018-11-04 22:23:03.398369"]]

  def destroy
    @dose = Dose.find(params[:id])
    @dose.destroy
---
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 3]]